# Shell extension to jump to frequently used directories
brew "autojump"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Git extension for versioning large files
brew "git-lfs"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
cask "font-source-code-pro"
cask "iterm2"
cask "keepassxc"
cask "meld"
cask "pock"
